package model;

import java.util.HashMap;
import java.util.Map;

public class Data {
    public static Map<Integer, Question> getQuestions(Object username) {

        String user = ((String) username).toUpperCase();

        Map<Integer, Question> map = new HashMap<>();
        map.put(1, new Question(user + ", ви прокинулись в незнайомому будинку. Тут доволі моторошно, ви хочете втікти звідси. Куди ви підете? Перед вами 2 двері. В яку ви увійдете спершу? ", new HashMap<>() {{
            put("Праворуч", 2);
            put("Ліворуч", 3);
        }}));

        map.put(2, new Question("За дверима що ви обрали, " + user + ", виявилась кімната заповнена отруйними павуками. В кінці кімнати, ви бачите розбите вікно, можливий вихід. Спробувати підійти до вікна та втікти з будинку чи повернутись назад?", new HashMap<>() {{
            put("Підійти до вікна", 5);
            put("Вийти з кімнати", 1);
        }}));

        map.put(3, new Question("Ви вийшли в загальний коридор будинку. Ту ви бачите двері що ведуть до виходу з будинку, а також червоні двері ще до однієї кімнати. Які ваші дії, " + user, new HashMap<>() {{
            put("Підійти до виходу", 13);
            put("До червоних дверей", 6);
            put("Повернутись в початкову кімнату", 1);
        }}));

        map.put(5, new Question("Ви спробували підійти до вікна, але павуки накинулись на вас та отруїли. Гру завершено.", Map.of()));

        map.put(6, new Question("Ви увійшли в кімнату за червоними дверима. В цій кімнаті ви бачите ліжко, стіл, та тумбу. Нічого дивного, звичайна кімната.", new HashMap<>() {{
            put("Заглянути під ліжко", 9);
            put("Оглянути стіл", 9);
            put("Відкрити шухляду", 10);
            put("Вийти з кімнати", 3);
        }}));

        map.put(7, new Question("Ви втекли і врятувались! Перемога!", Map.of()));

        map.put(8, new Question("Двері зачинені. Схоже, вам потрібен ключ.", new HashMap<>() {{
            put("Повернутись", 3);
        }}));

        map.put(9, new Question("Тут нічого нема", new HashMap<>() {{
            put("Повернутись", 6);
        }}));

        map.put(10, new Question("Ви заглянули в шухляду. Там лежав якийсь старий ключ. Ви вирішили його забрати із собою.", new HashMap<>() {{
            put("Повернутись", 6);
        }}));

        map.put(13, new Question("Ви підійшли до дверей виходу.", new HashMap<>() {{
            put("Відчинити", 13);
            put("Повернутись", 3);
        }}));

        return map;
    }
}
